#include "скрепы.h"

ВЕЛИЧИЕ() {
    СЛАВА_РОССИИ;
    ЧИСЛО массив[] = {23, 34, 54, 67, 7546, 56};
    ЧИСЛО массив_величина = ВЕЛИЧИНА(массив) / ВЕЛИЧИНА(массив[0]);
    ЧИСЛО я = 0;
    ЧИСЛО ч = 0;

    ЦИКЛ (я = 0; я < массив_величина; я++)
    {
        ЦИКЛ (ч = 0; ч < массив_величина - 1; ч++)
        {
            ЕСЛИ (массив[ч + 1] < массив[ч])
            {
                ЧИСЛО временное_значение = массив[ч];
                массив[ч] = массив[ч + 1];
                массив[ч + 1] = временное_значение;
            }
        }
    }

    ЦИКЛ (я = 0; я < массив_величина; я++)
    {
        ОТКЛИК("%d ", массив[я]);
    }

    ВОЗВРАТ ИХ_ЛОЖЬ;
}
